ednieuw/RTCcheck/Old/ESP32_CommV08_RTC02/ESP32_CommV08_RTC02.ino
    if (error == 0) 
     {
      Serial.print("DS3231 found on channel ");
      Serial.println(i);
     } 
     else
     {
      Serial.print("No DS3231 on channel ");
      Serial.print(i);
      Serial.print(" (Error: ");
      Serial.print(error);
      Serial.println(")");
     }
  }
  Serial.println("\nInitialising RTC modules...");                   // Initialiseonly found RTC modules
  for (int i = 0; i < MAX_RTC; i++) 
  {
    selectTCAChannel(i);                                             // Select multiplexer channel
    delay(50);
    
    Serial.print("Initialising RTC ");
    Serial.print(i);
    Serial.print("... ");
    
    // Test eerst of er een device is
    Wire.beginTransmission(0x68);
    if (Wire.endTransmission() != 0) 
    {
      Serial.println("NO DEVICE");
      continue;
    }
    
    if (!rtc[i].begin()) {
      Serial.println("FAILED!");
      Serial.println("Check connection on channel " + String(i));
      rtcActive[i] = false;
    } else {
      Serial.println("OK!");
      rtcActive[i] = true;
      activeRTCCount++;
      // DateTime now = rtc[i].now();                                   // Show current
      // sprintf(sptext,"Before update: %02d/%02d/%04d %02d:%02d:%02d ", now.day(),now.month(),now.year(),
      //                                             now.hour(),now.minute(),now.second());
      // Tekstprintln(sptext);
      // // Set time to compilation time
      // DateTime compileTime = DateTime(F(__DATE__), F(__TIME__));
      // Serial.print("  Time set to: ");
      // Serial.println(compileTime.timestamp(DateTime::TIMESTAMP_FULL));
      // rtc[i].adjust(compileTime);
      // delay(100);

      DateTime newTime = rtc[i].now();                               // Check time set
      sprintf(sptext,"It's current time: %02d/%02d/%04d %02d:%02d:%02d ", newTime.day(),newTime.month(),newTime.year(),
                                                                      newTime.hour(),newTime.minute(),newTime.second());
      Tekstprintln(sptext);  
    }
    delay(200); 
  }
  sprintf(sptext,"Setup finished! %d  RTC modules active.", activeRTCCount);
  Tekstprintln(sptext); 
  // Serial.print("Setup finished! ");
  // Serial.print(activeRTCCount);
  // Serial.println(" RTC modules active.");
  // Serial.println();
}
// //--------------------------------------------                       //
// // LOOP
// //--------------------------------------------
// void loop() 
// {
//   CheckSerialInput();
//   Every5SecondCheck(); 
// }

//--------------------------------------------                       //
// RTC8 Update routine 
// Performs tasks every 5 seconds
//--------------------------------------------
// void Every5SecondCheck(void)
// {
//  uint32_t msLeap = millis() - msTickRTC8;                                // 

//  if (msLeap >4999)                                                   // Every 5 second enter the loop
//  {
//    msTickRTC8 = millis();
// //   Loopcounter /= 5;
//    PrintRTCtimes();
// //   Loopcounter = 0;
//  }  
// }

// //--------------------------------------------                       //
// // Check voor seriële input voor commando's
// //-------------------------------------------- 
// void CheckSerialInput(void)
// {
//   if (Serial.available() > 0) 
//   {
//     String command = Serial.readStringUntil('\n');
//     command.trim();
    
//     if (command == "sync") 
//     {
//       synchronizeAllRTCs();
//       return;
//     }
//     if (command == "set") {
//       setCurrentTime();
//       return;
//     }
//     if (command == "help") {
//       Serial.println("available commands:");
//       Serial.println("  sync - Synchroniseer all RTC's with RTC 0");
//       Serial.println("  set  - Enter specific time");
//       Serial.println("  help - this help");
//       return;
//     }
//   }
// }
//--------------------------------------------                       //
// RTC8 Print RTC times
//-------------------------------------------- 
void PrintRTCtimes(void)
{
  for (int i = 0; i < MAX_RTC; i++)                                  // Read time of all ACTIVE RTC modules
  {
    if (!rtcActive[i]) continue;                                     // Skip non-active RTC's
    selectTCAChannel(i);
    delay(10);
    char Temp[16];
    dtostrf(rtc[i].getTemperature(), 0, 2, Temp); 
    DateTime now = rtc[i].now();
    sprintf(sptext,"RTC %d: %02d/%02d/%04d %02d:%02d:%02d T: %s C",
             i, now.day(),now.month(),now.year(), now.hour(),now.minute(),now.second(), Temp);
    Tekstprintln(sptext);    
  }
 // sprintf(sptext,"------------------- %d loops/s",Loopcounter);
 // Tekstprintln(sptext);   
}

// //--------------------------------------------                       //
// // COMMON common print routines
// //--------------------------------------------
// void Tekstprint(char const *tekst)    { if(Serial) Serial.print(tekst); }  //Serial.print(strlen(sptext));
// void Tekstprintln(char const *tekst)  { sprintf(sptext,"%s\n",tekst); Tekstprint(sptext); }

//--------------------------------------------                       //
// RTC8 Function to select TCA9548A channel
//--------------------------------------------
void selectTCAChannel(uint8_t channel) 
{
  if (channel > 7) return;                                           // Maximaal 8 kanalen (0-7)
  Wire.beginTransmission(TCA_ADDR);
  Wire.write(1 << channel);                                          // Select channel by setting bit
  uint8_t error = Wire.endTransmission();
  
  if (error != 0) 
   {
    sprintf(sptext,"Error selecting channel %d Error code : %d", channel,error);
    Tekstprintln(sptext);  
    // Serial.print("Error selecting channel ");
    // Serial.print(channel);
    // Serial.print(", error code: ");
    // Serial.println(error);
  }
  delay(10);                                                         // short delay after channel change
}
//--------------------------------------------                       //
// RTC8 set Time For RTC 
//--------------------------------------------
void setTimeForRTC(int rtcIndex, DateTime newTime) 
{
  if (!rtcActive[rtcIndex]) return;
  selectTCAChannel(rtcIndex);
  rtc[rtcIndex].adjust(newTime);
}
//--------------------------------------------                       //
// RTC8 Print Time For RTC 
//--------------------------------------------
void printTimeForRTC(int rtcIndex) 
{
  if (!rtcActive[rtcIndex]) return;
  selectTCAChannel(rtcIndex);
  DateTime now = rtc[rtcIndex].now();

  sprintf(sptext,"RTC %d: %s", now.timestamp(DateTime::TIMESTAMP_FULL).c_str());
  Tekstprintln(sptext);  
  // Serial.print("RTC ");
  // Serial.print(rtcIndex);
  // Serial.print(": ");
  // Serial.print(now.timestamp(DateTime::TIMESTAMP_FULL));
  // Serial.println();
}
//--------------------------------------------                       //
// RTC8 get Temperature For RTC
//--------------------------------------------
float getTemperatureForRTC(int rtcIndex) 
{
  if (!rtcActive[rtcIndex]) return -999;
  selectTCAChannel(rtcIndex);
  return rtc[rtcIndex].getTemperature();
}
//--------------------------------------------                                                //
// RTC8 Synchronize all RTC's with current time
//--------------------------------------------
void synchronizeAllRTCs()   // Zoek eerste actieve RTC als referentie
{
  int referenceRTC = -1;
  for (int i = 0; i < MAX_RTC; i++) 
     {  if (rtcActive[i]) { referenceRTC = i;  break;  }  }
  if (referenceRTC == -1) 
     {  Serial.println("No active RTC's found!");   return;  }
  
  selectTCAChannel(referenceRTC);
  DateTime referenceTime = rtc[referenceRTC].now();
  Tekstprintln("\n=== RTC SYNCHRONISATION ===");

    sprintf(sptext,"Reference time of RTC  %d loops/s",referenceRTC);
  Tekstprintln(sptext); 

